Revit 2027 API
FamilySizeTable Methods
The FamilySizeTable type exposes the following members.
Methods
Name | Description
AsValueString |  Gets the table cell value as a string.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetColumnHeader |  Gets a column of the table at at given index.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidColumnIndex |  Checks if the column index is valid.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FamilySizeTable Class
Autodesk.Revit.DB Namespace